In [1]:
import pandas as pd
from pathlib import Path

In [6]:
csvpath = Path("../Resources/sales.csv")
sales_dataframe = pd.read_csv(csvpath, header = None)
columns = ["Full Name", "Email", "Primary Address", "Zip Code", "Credit Card Number", "Sale Price"]
sales_dataframe.columns = columns
sales_dataframe.head()

,Full Name,Email,Primary Address,Zip Code,Credit Card Number,Sale Price
0,FullName,Email,Address,Zip,CreditCard,SalePrice
1,Elwanda White,alyre2036@live.com,352 Lakeshore Mall,9236,5327 0855 9720 7055,84.33
2,Lyndon Elliott,arrowy1873@outlook.com,1234 Avery Plaza,1330,3717 498777 19636,879.95
3,Daisey Sellers,toucan2024@outlook.com,469 Elwood Street,7631,3758 579477 35734,907.58
4,Issac Reeves,asarin1958@gmail.com,565 Phelps Field,81168,4400 0380 4162 1622,545.88

In [3]:
sales_dataframe.describe()

                Zip   SalePrice
count    100.000000  100.000000
mean   40952.160000  533.007200
std    30207.118496  275.531072
min      555.000000   29.720000
25%    11109.750000  328.507500
50%    40033.500000  536.110000
75%    65834.750000  767.885000
max    99877.000000  998.760000